<template>
    <div class="wrapper">
        <pageHeading :menuFixed="true" />

        <main class="content">
            <h1 class="page-heading">
                <div class="container">Политика обработки персональных данных</div>
            </h1>

            <br>

            <div class="container">
                <h2 class="h2-heading dark">Политика обработки <br> персональных данных</h2>
                <br>
                <p>
                    В данной Политике обработки персональных данных мы информируем Вас о порядке обработки Ваших персональных данных при использовании нашего веб-сайта owenpchv.ru далее — «Сайт».
                    <br> 
                    <br>
                    Мы обязуемся обеспечить конфиденциальность полученных от Вас персональных данных для целей, указанных в настоящей Политике обработки персональных данных, а также безопасность при их обработке в соответствии с требованиями Законодательства Российской Федерации.
                    <br>
                    <br>
                    При регистрации на Сайте, Вы предоставляете нам свои персональные данные, не являющиеся специальными или биометрическими, бессрочно (вплоть до отзыва Вами своего согласия на обработку персональных данных): имя, номер телефона, адрес электронной почты, а также иную информацию, относящуюся к Вам (физическому лицу) прямо или косвенно.
                    <br>
                    <br>
                    Настоящим Вы соглашаетесь с проведением нами онлайн-скоринга (оценки) таких Ваших персональных данных, как Ваше поведение на нашем Сайте, cookie, сведения о геопозиции, IP-адрес.
                    <br>
                    <br>
                    Настоящим Вы подтверждаете, что действуете свободно, своей волей и в своем интересе, а также подтверждаете свою дееспособность.
                    <br>
                    <br>
                    Предоставляя свои персональные данные, Вы соглашаетесь с тем, что предоставленные Вами персональные данные будут обрабатываться нами, а именно: ООО "ОВЕН ЦИФРОВЫЕ РЕШЕНИЯ", адрес (место нахождения): г. Москва, ул. 2-я Энтузиастов, д. 5 к. 5, помещ. 1/1, ИНН 7720929575, ОГРН 1247700368035, как с использованием средств автоматизации, так и без использования таких средств.
                    <br>
                    <br>
                    В ходе обработки с Вашими персональными данными будут совершены следующие действия: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
                    <br>
                    <br>
                    Настоящим Вы даете нам согласие на передачу своих персональных данных третьим лицам для их обработки в соответствии с целями, предусмотренными настоящей Политикой обработки персональных данных, на основании договоров, заключенных нами с этими третьими лицами и только в рамках таких договоров.
                    <br>
                    <br>
                    Не считается нарушением обязательств передача информации в соответствии с обоснованными и применимыми требованиями законодательства Российской Федерации.
                    <br>
                    <br>
                    Мы используем предоставленные Вами персональные данные в целях: - отправки Вам маркетинговых, рекламных и новостных рассылок, включая, но не ограничиваясь, новости о нас и наших партнерах; информацию о ценах на товары, наши предложения и предложения наших партнеров; - отправки Вам сообщений информационного характера и сервисных сообщений; - для осуществления деятельности по продвижению товаров и услуг; - оценки и анализа работы Сайта; - информирования Вас об акциях, скидках и специальных предложениях посредством электронных рассылок.
                    <br>
                    <br>
                    Настоящим Выподтверждаете, что сообщили нам собственные и достоверные персональные данные.
                    <br>
                    <br>
                    Данное Вами согласие действительно с момента сообщения нам Вами персональных (регистрационных) данных.
                    <br>
                    <br>
                    Настоящим уведомляем Вас, что в том случае, если хотите внести уточнения в Ваши персональные данные, заблокировать или уничтожить их в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, либо в случае возникновения у Вас желания отозвать свое согласие на обработку персональных данных или устранить наши неправомерные действия в отношении Ваших персональных данных, то Вы должны направить нам официальный запрос в следующем порядке: направив нам официальный запрос по Почте России по адресу: 111024, г. Москва, ул. 2-я Энтузиастов, д. 5 к. 5, помещ. 1/1, в качестве получателя необходимо указывать: ООО "ОВЕН ЦИФРОВЫЕ РЕШЕНИЯ".
                    <br>
                    <br>
                    В случае направления нам официального запроса в тексте запроса необходимо указать Ваши: - ФИО; - номер основного документа, удостоверяющего личность субъекта персональных данных или его представителя, сведения о дате выдачи указанного документа и выдавшем его органе; - сведения, подтверждающие Ваше участие в отношениях с нами либо сведения, иным способом подтверждающие факт обработки нами Ваших персональных данных; - подпись гражданина (или его законного представителя).
                    <br>
                    <br>
                    Если запрос отправляется в электронном виде, то он должен быть оформлен в виде электронного документа и подписан электронной подписью в соответствии с законодательством РФ.
                    <br>
                    <br>
                    Мы обязуемся немедленно прекратить обработку Ваших персональных данных с момента получения от Вас письменного заявления (отзыва) и/или в случае достижения цели обработки и уничтожим их в срок и на условиях, установленных законом.
                    <br>
                    <br>
                    Вы можете отписаться от маркетинговых, рекламных и новостных рассылок путём направления нам соответствующего запроса на адрес электронной почты (E-mail) <a href="mailto:internet@owen.ru">internet@owen.ru</a>.
                    <br>
                    <br>
                    Мы не несем ответственности за сведения, предоставленные Вами на Сайте в общедоступной форме.
                    <br>
                    <br>
                    При обработке персональных данных мы принимаем необходимые и достаточные организационные и технические меры для защиты персональных данных от неправомерного доступа к ним, а также от иных неправомерных действий в отношении персональных данных.
                    <br>
                    <br>
                    Обращаем Ваше внимание, что данная Политика обработки персональных данных может обновляться, в связи с возможными поправками в Законодательстве Российской Федерации, а также изменениями наших внутренних процессов. Новая редакция Политики обработки персональных данных вступает в силу с момента ее размещения на Сайте.
                </p>
            </div>
        </main>

        <pageFooter/>
    </div>
</template>

<script>
import { useMeta } from 'vue-meta';
import pchvImage from "../../assets/images/pchvTopSection.png";

import pageHeading from "../components/pageHeading.vue";
import pageFooter from '../components/pageFooter.vue';

    export default {
        name: "personalDataProcessingPolicy",
        
        components: {
            pageHeading,
            pageFooter,
        },

        setup () {
            useMeta({
                title: "Политика обработки персональных данных",
                description: "Преобразователи частоты ПЧВ ОВЕН для насосов, вентиляторов и другой приводной техники",
                og: {
                    title: "Политика обработки персональных данных",
                    description: "Преобразователи частоты ПЧВ ОВЕН для насосов, вентиляторов и другой приводной техники",
                    url: "https://pchv.owen.ru/privacy",
                    type: "website",
                    image: pchvImage,
                }
            })
        },
    }
</script>

<style lang="scss" scoped>
    p {
        color: $colored-text;
        line-height: 1.3;
        margin: 0 0 70px 0;

        @media (max-width: 768px) {
            margin: 0 0 30px 0;
        }

        a {
            color: $primary-color;

            @media (hover: hover) and (pointer: fine) {
                &:hover {
                    color: $secondary-color;
                }
            }
        }
    }
</style>